{
  "hero_title": "Front-end Developer",
  "hero_location": "Spain, Madrid",
  "hero_view_work": "View My Work",
  "hero_download_cv": "Download CV",
  "about_title": "About Me",
  "about_profile": "Professional Profile",
  "about_info": "Front-End Developer with experience in React and TypeScript, currently building digital solutions from scratch for the financial sector. I've worked on national-scale campaigns and products, and collaborated in established environments using Angular and Vue.",
  "about_interests": "I'm interested in building well-designed, efficient products with impact. I'm looking for projects where I can continue to grow and contribute from the front lines.",
  "about_languages": "Languages",
  "about_spanish": "Spanish",
  "about_level_native": "Native",
  "about_english": "English",
  "about_level_advanced": "Advanced, B2 Certified",
  "about_additional_info": "Additional Info",
  "about_license": "Driver's license & car",
  "skills_title": "Habilidades y Tecnologías",
  "skills_bbdd": "Databases",
  "skills_methodologies": "Methodologies",
  "skills_os": "Operating Systems",
  "skills_tools": "Tools",
  "projects_title": "Featured Projects",
  "projects_interest": "Interested in my work?",
  "projects_contact": "Contact Me!",
  "projects_under_construction": "🚧 This section is under construction. Projects will appear here soon!",
  "projects_id1_title": "My Web Portfolio",
  "projects_id1_description": "A web application that showcases my capabilities as a front-end programmer, including projects, experience, and skills. It also features carefully crafted graphics. It also includes a virtual assistant, an interactive and animated background, an interactive music player with a timer, and a section where I can view my current connection status in real time.",
  "projects_id2_title": "LAIKA Music Player",
  "projects_id2_description": "Collaborative project with Malena Muñoz for the final project of the Web Application Development cycle. A music player that uses the Spotify API, with the goal of reimagining Spotify and giving it our personal touch. NOTICE: THE WEBSITE IS ONLY COMPATIBLE WITH DESKTOP RESOLUTIONS",
  "projects_id3_title": "My Arch Linux Server",
  "projects_id3_description": "My most ambitious project to date. After weeks of work, I've managed to create an Arch Linux server with a custom GNOME desktop environment and Hyprland thanks to GDM. The goal is to have a personal server where I can host my own websites and servers. Yes, this entire website and all my other projects are being hosted from my own private server. This project has allowed me to delve deeper into systems and network administration.",
  "projects_flex": "All projects hosted from my own private server. :P",
  "experience_title": "Experience & Education",
  "experience_professional": "Professional Experience",
  "experience_location": "Madrid, España",
  "experience_position1": "Software Engineer",
  "experience_company1": "Banco Cooperativo Español",
  "experience_period1": "Jun 2023 – Present",
  "experience_description1.1": "Development of national-scale digital projects and campaigns (landing pages, microsites, forms, interactive tools) with integration into Adobe Campaign workflows.",
  "experience_description1.2": "Design and implementation of React + TypeScript components and utilities focused on accessibility, performance, and reusability.",
  "experience_description1.3": "Collaboration and support on Angular and Vue codebases, ensuring pattern consistency and rapid bug resolution.",
  "experience_description1.4": "I work in agile environments (Scrum/Kanban) with design/UX and backend experience; end-to-end feature ownership.",
  "experience_description1.5": "Automation with Python: QA scripts and support (content/data validation, template and checklist generation, consumption of internal REST APIs and CLI utilities) to reduce manual tasks and accelerate delivery.",
  "experience_company2": "Fiscales Alternative S.L.",
  "experience_period2": "Mar 2023 – Jun 2023",
  "experience_description2.1": "Contributed to the development of tools for content automation and analysis for digital media and brands, building reactive and optimized UIs.",
  "experience_description2.2": "Built reusable components and visual dashboards using React and TypeScript, connected to back-end systems via REST APIs.",
  "experience_description2.3": "Managed application state and async data flows for real-time data visualization.",
  "experience_description2.4": "Worked in a collaborative Scrum and Kanban environment, directly with UX, product, and back-end to deliver functional iterations each sprint.",
  "experience_education": "Education",
  "experience_grade": "Web Application Development",
  "experience_institution": "C.F.P. Juan XXIII",
  "experience_period3": "2021 – 2023",
  "experience_description3.1": "Developed complete applications using PHP, Java, and C, applying structured programming principles.",
  "experience_description3.2": "Built functional and accessible interfaces with HTML, CSS, JavaScript focused on user experience.",
  "experience_description3.3": "Participated in an end-of-degree project (TFG), taking a key role in the web development area.",
  "experience_description3.4": "Applied Scrum and agile methodologies, assuming different roles in various stages of development.",
  "contact_title": "Get In Touch",
  "contact_subtitle": "I'm always interested in new opportunities and collaborations. Let's discuss how we can work together to create something amazing.",
  "contact_connect": "Let's Connect",
  "contact_email": "Email",
  "contact_location": "Location",
  "contact_download": "Download Resume",
  "contact_social": "Social Links",
  "contact_wantto": "Want to contact me?",
  "contact_online": "I'm online and ready to chat. You can expect a fast reply today 🚀",
  "contact_away": "I'm currently away. I'll respond within a few hours 🕒",
  "contact_offline": "I'm currently offline. I usually respond within 2-3 hours. Leave your message! 📨",
  "contact_estimated": "⏱ Estimated response time: ",
  "contact_response_online": "Less than 1 hour",
  "contact_response_away": "Within 1-2 hours",
  "contact_response_offline": "Within today",
  "contact_tips": "💡 Tips when writing me:",
  "contact_tips1": "Be specific about what you're reaching out for.",
  "contact_tips2": "Include relevant links or files.",
  "contact_tips3": "Let me know your timezone (optional but helpful).",
  "contact_quote": "The best way to get a response is to be human first.",
  "footer_made_with": "Made with",
  "nav_home": "Home",
  "nav_about": "About",
  "nav_skills": "Skills",
  "nav_projects": "Projects",
  "nav_experience": "Experience",
  "nav_contact": "Contact",
  "filter_all": "All",
  "filter_web": "Web Application",
  "filter_dashboard": "Dashboard",
  "filter_ui": "UI/UX Design",
  "rotom_welcome": "Hello! I'm Rotom. What do you want to do?",
  "rotom_talk": "Great! What do you want to talk about?",
  "rotom_option.talk": "Talk",
  "rotom_option.exit": "Exit",
  "rotom_option.who": "Who are you?",
  "rotom_option.projects": "Want to see projects",
  "rotom_option.contact": "Want to contact Lucas",
  "rotom_option.help": "Help",
  "rotom_bye": "See you later!",
  "rotom_projects_intro": "We have several web projects around here, let me show you!",
  "rotom_who_i_am": "I'm an assistant to help you understand how this site was made.",
  "rotom_not_needed": "Although I wouldn't be necessary if my creator had made the website more intuitive and simple. Still, I'm here to show you all the potential hidden in this portfolio.",
  "rotom_projects_empty": "Remember that all projects, including the website you're currently on, are being hosted on my creator's private server running Arch Linux... That server is, in theory, my home!",
  "rotom_option.why_no_projects": "Why are there no projects?",
  "rotom_why_no_projects": "Oh... well... it's not that there aren't any. My creator wanted this portfolio ready as soon as possible and had to make sacrifices. The original idea was to self-host everything along with the portfolio, but that took longer than expected.",
  "rotom_help": "I'm sure I can help, what is it about?",
  "rotom_option.cant_see": "Cant see the site correctly",
  "rotom_option.music": "For what is the music player?",
  "rotom_browser_question": "Got it, before I help, which browser are you using?",
  "rotom_firefox_explanation": "If you're using Firefox, it may not support some of the visual styles on this site. I recommend enabling hardware acceleration in your browser settings.",
  "rotom_chromium_explanation": "If you're on Chromium and the site looks broken, you may not have hardware acceleration enabled. Please enable it and reload.",
  "rotom_music_reason": "My creator loves music. To make this portfolio more personal, he added a music player that changes depending on the hour.",
  "rotom_music_behavior": "Each hour the song changes. The entire page transforms with the song. Also, when my creator sleeps, the music changes too. It's worth checking out — it took a lot of effort.",
  "rotom_contact_intro": "Of course, let me explain everything here.",
  "rotom_contact_details": "As you see, there are many contact options. He prefers LinkedIn, but email is always welcome.",
  "rotom_option.contact_big_section": "What is the big section?",
  "rotom_contact_big_section": "Oh right! My creator added a system to show whether he's online or not. If he's online, he'll reply quickly. Away? Maybe a few minutes. Offline? It might take longer, but he always responds!"
}
