{
  "hero_title": "Front-end Developer",
  "hero_location": "España, Madrid",
  "hero_view_work": "Ver mi trabajo",
  "hero_download_cv": "Descargar CV",
  "about_title": "Sobre mí",
  "about_profile": "Perfil Profesional",
  "about_info": "Desarrollador front-end con experiencia en React y TypeScript, construyendo actualmente soluciones digitales desde cero para el sector financiero. He trabajado en campañas y productos a escala nacional, y he colaborado en entornos establecidos usando Angular y Vue.",
  "about_interests": "Estoy interesado en construir productos bien diseñados y eficientes con impacto. Busco proyectos en los que pueda seguir creciendo y contribuir desde la primera línea.",
  "about_languages": "Idiomas",
  "about_spanish": "Español",
  "about_level_native": "Nativo",
  "about_english": "Ingles",
  "about_level_advanced": "Avanzado, B2 Certificado",
  "about_additional_info": "Información Adicional",
  "about_license": "Licencia de conducir y coche",
  "skills_title": "Habilidades y Tecnologías",
  "skills_bbdd": "Bases de Datos",
  "skills_methodologies": "Metodologias",
  "skills_os": "Sistemas Operativos",
  "skills_tools": "Herramientas",
  "projects_title": "Proyectos Destacados",
  "projects_interest": "¿Interesado en mi trabajo?",
  "projects_contact": "¡Contáctame!",
  "projects_under_construction": "🚧 Esta sección está en construcción. ¡Los proyectos aparecerán aquí pronto!",
  "projects_id1_title": "Mi Portfolio Web",
  "projects_id1_description": "Una aplicacion web que muestra mis capacidades como programador Front-End, incluyendo proyectos, experiencia y habilidades. Ademas de un apartado grafico cuidado al detalle. Asistente virtual, fondo interactivo y animado, reproductor de musica interactiva por horarios y un apartado donde ver mi estado de conexion actual a tiempo real.",
  "projects_id2_title": "LAIKA Music Player",
  "projects_id2_description": "Proyecto colaborativo con Malena Muñoz con motivo del TFC del ciclo de Desarrollo de Aplicaciones Web. Un reproductor de música que usa la API de Spotify, con el objetivo de reimaginar Spotify y darle nuestro toque personal. AVISO: LA WEB SOLO ES COMPATIBLE CON RESOLUCIONES DE ESCRITORIO",
  "projects_id3_title": "Mi Servidor de Arch Linux",
  "projects_id3_description": "Mi proyecto mas ambicioso hasta la fecha, despues de semanas de trabajo, he conseguido crear un servidor de Arch Linux con un entorno de escritorio personalizado en GNOME y con hyprland gracias a GDM con el objetivo de tener un servidor personal donde hostear mis propias webs y servidores, y si, toda esta web y todas mis demas proyectos estan siendo hosteados desde mi servidor propio y privado. Este proyecto me ha permitido profundizar en la administración de sistemas y redes.",
  "projects_flex": "Todos los proyectos hosteados desde mi propio servidor privado. :P",
  "experience_title": "Experiencia y Educación",
  "experience_professional": "Experiencia Profesional",
  "experience_location": "Madrid, España",
  "experience_position1": "Software Engineer",
  "experience_company1": "Banco Cooperativo Español",
  "experience_period1": "Jun 2023 – Presente",
  "experience_description1.1": "Desarrollo de proyectos y campañas digitales a escala nacional (landing pages, micrositios, formularios, herramientas interactivas) con integración en flujos de trabajo de Adobe Campaign.",
  "experience_description1.2": "Diseño e implementación de componentes y utilidades React + TypeScript enfocados en accesibilidad, rendimiento y reutilización.",
  "experience_description1.3": "Colaboración y soporte en bases de código Angular y Vue, lo que garantiza la consistencia de los patrones y la resolución rápida de errores.",
  "experience_description1.4": "Trabajo en entornos ágiles (Scrum/Kanban) con experiencia en diseño/UX y backend; Propiedad de características de extremo a extremo.",
  "experience_description1.5": "Automatización con Python: scripts de control de calidad y soporte (validación de contenido/datos, generación de plantillas y listas de verificación, consumo de API REST internas y utilidades CLI) para reducir las tareas manuales y acelerar la entrega.",
  "experience_company2": "Fiscales Alternative S.L.",
  "experience_period2": "Mar 2023 – Jun 2023",
  "experience_description2.1": "Contribución al desarrollo de herramientas para la automatización y análisis de contenido para medios digitales y marcas, construyendo interfaces de usuario reactivas y optimizadas.",
  "experience_description2.2": "Creación de componentes reutilizables y paneles visuales utilizando React y TypeScript, conectados a sistemas back-end a través de API REST.",
  "experience_description2.3": "Administré el estado de aplicaciones y flujos de datos asincrónicos para visualización de datos en tiempo real.",
  "experience_description2.4": "Trabajé en un entorno colaborativo Scrum y Kanban, directamente con UX, producto y back-end para entregar iteraciones funcionales en cada sprint.",
  "experience_education": "Educación",
  "experience_grade": "Desarrollo de Aplicaciones Web",
  "experience_institution": "C.F.P. Juan XXIII",
  "experience_period3": "2021 – 2023",
  "experience_description3.1": "Desarrollé aplicaciones completas utilizando PHP, Java y C, aplicando principios de programación estructurada.",
  "experience_description3.2": "Construí interfaces funcionales y accesibles con HTML, CSS, JavaScript enfocados en la experiencia del usuario.",
  "experience_description3.3": "Participé en el proyecto de fin de grado (TFG), desempeñando un rol clave en el área de desarrollo web.",
  "experience_description3.4": "Apliqué metodologías Scrum y ágiles, asumiendo diferentes roles en las distintas etapas del desarrollo.",

  "contact_title": "Ponte en Contacto",
  "contact_subtitle": "Siempre estoy interesado en nuevas oportunidades y colaboraciones. Hablemos sobre cómo podemos trabajar juntos para crear algo increíble.",
  "contact_connect": "Conectemos",
  "contact_email": "Correo",
  "contact_location": "Ubicación",
  "contact_download": "Descargar CV",
  "contact_social": "Enlaces Sociales",

  "contact_wantto": "¿Quieres contactarme?",
  "contact_online": "Estoy en línea y listo para chatear. Puedes esperar una respuesta rápida hoy 🚀",
  "contact_away": "Actualmente estoy ausente. Responderé en unas horas 🕒",
  "contact_offline": "Actualmente estoy desconectado. Normalmente respondo en 2-3 horas. ¡Déjame tu mensaje! 📨",
  "contact_estimated": "⏱ Tiempo estimado de respuesta: ",
  "contact_response_online": "Menos de 1 hora",
  "contact_response_away": "Entre 1-2 horas",
  "contact_response_offline": "Durante el día de hoy",
  "contact_tips": "💡 Consejos al escribirme:",
  "contact_tips1": "Sea específico acerca de lo que busca.",
  "contact_tips2": "Incluya enlaces o archivos relevantes.",
  "contact_tips3": "Déjame saber tu zona horaria (opcional pero útil).",
  "contact_quote": "La mejor manera de obtener una respuesta es ser humano primero.",
  "footer_made_with": "Hecho con",
  "nav_home": "Inicio",
  "nav_about": "Sobre mí",
  "nav_skills": "Habilidades",
  "nav_projects": "Proyectos",
  "nav_experience": "Experiencia",
  "nav_contact": "Contacto",
  "filter_all": "Todos",
  "filter_web": "Aplicación Web",
  "filter_dashboard": "Panel",
  "filter_ui": "Diseño UI/UX",
  "rotom_welcome": "¡Hola! Soy Rotom. ¿Qué quieres hacer?",
  "rotom_talk": "¡Genial! ¿De qué quieres hablar?",
  "rotom_option.talk": "Hablar",
  "rotom_option.exit": "Salir",
  "rotom_option.who": "¿Quién eres?",
  "rotom_option.projects": "Quiero ver los proyectos",
  "rotom_option.contact": "Quiero contactar con Lucas",
  "rotom_option.help": "Ayuda",
  "rotom_bye": "¡Nos vemos!",
  "rotom_projects_intro": "Tenemos varios proyectos web por aquí, ¡te los enseño!",
  "rotom_who_i_am": "Soy una asistente que te ayudará a entender cómo se ha hecho esta web.",
  "rotom_not_needed": "Aunque yo no sería necesario si mi creador hubiera hecho más intuitiva y simple su web. De todas formas estoy aquí para enseñarte todo el potencial que esconde este portfolio.",
  "rotom_projects_empty": "Recuerda que todos los proyectos incluida la web donde estas ahora mismo están siendo hosteados desde el servidor privado de mi creador con Arch Linux... En teoria ese servidor es mi casa!",
  "rotom_option.why_no_projects": "¿Porque no hay proyectos?",
  "rotom_why_no_projects": "Oh... ya... bueno, verás que no es que no haya, mi creador quería que este portfolio estuviera listo lo antes posible, por lo que tuvo que hacer varios sacrificios. Su idea original era hostear todos sus proyectos junto con su portfolio en un servidor propio, pero eso ha llevado más tiempo de lo esperado.",
  "rotom_help": "¡Seguro que puedo ayudarte! ¿De qué se trata?",
  "rotom_option.cant_see": "No veo correctamente la web",
  "rotom_option.music": "¿Para que es el music player?",
  "rotom_browser_question": "Comprendo. Antes de ayudarte, ¿qué navegador usas?",
  "rotom_firefox_explanation": "Si estás usando Firefox, su motor no soporta ciertos estilos que usa la web. Te recomiendo activar la aceleración por hardware en las opciones del navegador.",
  "rotom_chromium_explanation": "Si usas Chrome, Edge, Opera o Brave y ves mal la web, probablemente no tienes habilitada la aceleración por hardware. Actívala y vuelve a cargar.",
  "rotom_music_reason": "A mi creador le encanta la música. Como este es su portfolio, quiso hacerlo más suyo compartiendo lo que le gusta, incluso su música.",
  "rotom_music_behavior": "Cada hora la canción cambia por otra y, no solo eso, también cambia la página en armonía con la canción. Además, cuando mi creador duerme, cambia también la música. ¡Échale un ojo, que le costó mucho trabajo!",
  "rotom_contact_intro": "Por supuesto, permíteme explicarte todo aquí.",
  "rotom_contact_details": "Como ves, aquí tienes muchas opciones de contacto. Él prefiere LinkedIn, aunque escribirle un correo siempre es bienvenido.",
  "rotom_option.contact_big_section": "¿Que es la sección grande de contacto?",
  "rotom_contact_big_section": "Oh, cierto. Mi creador ha implementado un sistema para que el usuario sepa cuándo está online o no. Si lo está, responde de inmediato; si aparece ausente, puede tardar unos minutos; si está offline, puede tardar más, ¡pero siempre responde!"
}
